# Compare Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
WorksetId..::..Compare Method
WorksetId Class See Also
---
Compares two WorksetIds.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public int Compare(
	WorksetId id
)
```

Visual Basic
---
```text
Public Function Compare ( _
	id As WorksetId _
) As Integer
```

Visual C++
---
```text
public:
int Compare(
	WorksetId^ id
)
```

# ### Parameters
id
    Type: Autodesk.Revit.DB..::..WorksetIdThe WorksetId to be compared with this WorksetId.
# ### Return Value
-1 if this WorksetId is less than id, 0 if equal, 1 if greater.
# See Also
WorksetId Class
Autodesk.Revit.DB Namespace